# 設定帳密資料等

USERID = ""
PASSWORD = ""
URL = "https://kiki.ccu.edu.tw/~ccmisp06/cgi-bin/class_new/"
LOGINROUTER = "bookmark.php"
ROBCLASSROUTER = "Add_Course01.cgi"

# 多少次搶課後要重新登錄一次，預設150
ROUNDTIMES = 150

# 一秒送出多少次請求，預設三次，最多可到10次
TIMESINONESECOND = 3

# 這邊存想搶課程的payload
# session_id 在 main 拿
ROBCLASSLIST = [
    # 這堂是周二 2, 3 的星空探索
    {
        "session_id": "",
        "dept": "I001",
        "grade": "1",
        "cge_cate": "2",
        "cge_subcate": "6",
        "page": "2",
        "e": "0",
        "m": "0",
        "SelectTag": "1",
        "7500030_02": "3",
        "7501019_01": "3",
        "7502001_01": "3",
        "7502002_01": "3",
        "7503012_01": "3",
        "7505010_01": "3",
        "7506011_01": "3",
        "course": "7506012_01",
        "7506012_01": "3",
        "7506012_02": "3",
        "7506014_01": "3"
    },
    # 這堂是電機系的超大型積體電路
    {
        "session_id": "",
        "dept": "4154",
        "grade": "3",
        "cge_cate": "",
        "cge_subcate": "",
        "page": "1",
        "e": "0",
        "m": "0",
        "SelectTag": "1",
        "4152015_01": "2",
        "4153002_01": "2",
        "4153203_01": "2",
        "4153205_01": "2",
        "course": "4153206_01",
        "4153206_01": "2",
        "4153208_01": "2",
        "4153211_01": "2",
        "4153900_01": "2",
        "4153918_01": "2",
        "4153919_01": "2"
    },
    # 資工系 軟體工程
    {
        "session_id": "",
        "dept": "4104",
        "grade": "3",
        "cge_cate": "",
        "cge_subcate": "",
        "page": "1",
        "e": "0",
        "m": "0",
        "SelectTag": "1",
        "4103001_01": "1",
        "4103001_02": "1",
        "course": "4103022_01",
        "4103022_01": "2",
        "4103026_01": "2",
        "4103055_01": "1",
        "4103055_02": "1",
        "4103800_01": "1"
    }
]